In [1]:
import sqlite3
import pandas as pd

In [2]:
# 1. Create or open an SQLite database file
conn = sqlite3.connect("example.db")

In [3]:
conn

In [4]:
# 2. List the existing tables
tables_query = "SELECT name FROM sqlite_master WHERE type='table'"
tables = pd.read_sql_query(tables_query, conn)

In [7]:
tables

Empty DataFrame
Columns: [name]
Index: []

In [8]:
# 3. Create a table
create_table_query = """
CREATE TABLE IF NOT EXISTS users (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    age INTEGER,
    email TEXT UNIQUE
)
"""
conn.execute(create_table_query)

In [9]:
# Check if the table was successfully created
table_exists_query = (
    "SELECT name FROM sqlite_master WHERE type='table' AND name='users'"
)
table_exists = pd.read_sql_query(table_exists_query, conn)

In [10]:
table_exists

    name
0  users

In [11]:
# 4. Insert data into the table
data_to_insert = pd.DataFrame(
    {
        "name": ["John Doe"],
        "age": [30],
        "email": ["john.doe@example.com"],
    }
)
data_to_insert.to_sql("users", conn, if_exists="append", index=False)

1

In [12]:
# Insert multiple rows
additional_users = pd.DataFrame(
    {
        "name": ["Jane Smith", "Alice Johnson"],
        "age": [28, 32],
        "email": ["jane.smith@example.com", "alice.johnson@example.com"],
    }
)
additional_users.to_sql("users", conn, if_exists="append", index=False)

2

In [13]:
# 5. Retrieve data
# Retrieve all users
users_query = "SELECT * FROM users"
users = pd.read_sql_query(users_query, conn)

In [14]:
users

   id           name  age                      email
0   1       John Doe   30       john.doe@example.com
1   2     Jane Smith   28     jane.smith@example.com
2   3  Alice Johnson   32  alice.johnson@example.com

In [15]:
users.head()

   id           name  age                      email
0   1       John Doe   30       john.doe@example.com
1   2     Jane Smith   28     jane.smith@example.com
2   3  Alice Johnson   32  alice.johnson@example.com

In [16]:
# Retrieve users with a specific name
specific_user_query = "SELECT * FROM users WHERE name = ?"
specific_user = pd.read_sql_query(specific_user_query, conn, params=("Jane Smith",))

In [17]:
specific_user

   id        name  age                   email
0   2  Jane Smith   28  jane.smith@example.com

In [18]:
# 6. Update data
update_query = "UPDATE users SET age = ? WHERE name = ?"
conn.execute(update_query, (31, "Jane Smith"))

In [19]:
updated_user_query = "SELECT * FROM users WHERE name = ?"
updated_user = pd.read_sql_query(updated_user_query, conn, params=("Jane Smith",))

In [20]:
updated_user

   id        name  age                   email
0   2  Jane Smith   31  jane.smith@example.com

In [21]:
# 7. Delete data
delete_query = "DELETE FROM users WHERE id = ?"
conn.execute(delete_query, (2,))

In [22]:
all_users_after_deletion = pd.read_sql_query(users_query, conn)
all_users_after_deletion

   id           name  age                      email
0   1       John Doe   30       john.doe@example.com
1   3  Alice Johnson   32  alice.johnson@example.com

In [23]:
# 8. Close the connection
conn.close()